<!-- 该项目每个vue文件的代码模板 -->
<template>
    <div>
        <p>编号：{{content.protocol_id}}</p>
        <h2>借款协议</h2>
        <p>甲方（出借方）</p>
        <p>真实姓名/企业名称：{{content.investor_name}}</p>
        <p class="st-mb">身份证号/企业证号：{{content.investor_card_id}}</p>
        <p>乙方（借款方）</p>
        <p>公司名称：{{content.borrower_name}}</p>
        <p class="st-mb">统一社会代码：{{content.borrower_credit_code}}</p>
        <p>丙方（居间服务方）</p>
        <p class="st-mb">公司名称：{{content.plat_name}}</p>
        <p>丁方（担保方）</p>
        <p class="st-mb">公司名称：{{content.warrantor_name}}</p>
        <p>鉴于：</p>
        <p>1、甲方已在丙方官网或手机客户端（APP）注册，并承诺对本协议涉及的借款金额具有完全的支配能力，是其自有闲散资金，为其合法所得；并承诺其提供给丙方的身份等信息是真实、准确、完整和有效的；</p>
        <p>2、乙方已在丙方官网或手机客户端（APP）注册，并承诺其提供给丙方的身份、融资等信息是真实、准确、完整和有效的；</p>
        <p>3、丙方是一家在杭州合法成立并有效存续的有限责任公司，本次借款由丙方提供居间撮合服务，甲、乙双方同意于平台线上签署本协议并据此产生约束双方的法律效力。</p>
        <p>官网域名：{{content.plat_website}}</p>
        <p>4、丁方是合法成立并有效存续的有限责任公司；</p>
        <p class="st-mb">5、乙方有借款/融资需求，甲方亦同意出借款项，双方有意成立借贷关系。</p>
        <p>各方经协商一致，签订如下协议，共同遵照履行： </p>
        <h3>第一条 定义 </h3>
        <p>在本协议中，除非上下文另有解释或文义另有所指，下述名词具有如下定义：</p>
        <table class="lemuji-table">
            <tr>
                <td colspan="2">涉及各相关方的定义</td>
            </tr>
            <tr>
                <td>华侨宝</td>
                <td>指杭州华侨宝网络科技有限公司。</td>
            </tr>
            <tr>
                <td>注册用户</td>
                <td>指在平台完成实名认证注册，参与平台项下交易的机构或自然人。</td>
            </tr>
            <tr>
                <td>出借人</td>
                <td>指在平台上向甲方出借资金的注册用户。</td>
            </tr>
            <tr>
                <td colspan="2">涉及线上操作的定义</td>
            </tr>
            <tr>
                <td>平台</td>
                <td>指杭州华侨宝有限公司设立并运营管理的，为注册用户提供包括但不限于线上交易；信息传递、披露与撮合；辅助结算等相关服务的电子交易系统，包括华侨宝平台（网址为:www.huaqiaobao.cn ）</td>
            </tr>
            <tr>
                <td>支付机构</td>
                <td>指为平台交易资金提供支付结算服务的第三方支付机构或商业银行等机构。</td>
            </tr>
            <tr>
                <td>存管账户</td>
                <td>指为平台交易资金提供支付结算服务的商业银行等机构。</td>
            </tr>
            <tr>
                <td>交易规则</td>
                <td>指杭州华侨宝网络科技有限公司为平台制定的《华侨宝用户使用协议》，以及对其不时的修改或补充。</td>
            </tr>
            <tr>
                <td>保证人</td>
                <td>{{content.warrantor_name}}</td>
            </tr>
            <tr>
                <td>保证申请函</td>
                <td>指乙方向保证人申请，且保证人同意为甲方在本协议项下还款义务承担连带责任保证的申请函。</td>
            </tr>
            <tr>
                <td>保证函</td>
                <td>指保证人根据乙方申请向乙方出具 的保证函。</td>
            </tr>
            <tr>
                <td colspan="2">其他定义</td>
            </tr>
            <tr>
                <td>不可抗力</td>
                <td>指在本协议签署后发生的、本协议签署时不能预见的、其发生与后果无法避免或克服的、妨碍任何一方全部或部分履约的所有事件。上述事件包括地震、台风、水灾、火灾、战争、国际或国内通讯或运输中断、电力中断、大规模网络瘫痪、政府或公共机构的行为（包括重大法律变更或政策调整）、流行病、动乱、罢工，以及一般国际商业惯例认作不可抗力的其他事件。</td>
            </tr>
            <tr>
                <td>中国</td>
                <td>指中华人民共和国，为本协议之目的，不包括香港特别行政区、澳门特别行政区和台湾地区。</td>
            </tr>
            <tr>
                <td>法律</td>
                <td>指中国有权机关颁布的法律、行政法规、地方性法规、部门规章或其他任何规范性文件。</td>
            </tr>
            <tr>
                <td>工作日</td>
                <td>指中国的银行对公众营业的营业日（星期六、星期日和法定假期除外）</td>
            </tr>
        </table>
        <h3>第二条 借款 </h3>
        <h4>2.1 借款基本信息</h4>
        <table>
            <tr>
                <td>借款本金</td>
                <td>{{content.invest_account?content.invest_account+'元':''}}</td>
            </tr>
            <tr>
                <td>借款起息日</td>
                <td>满标次日</td>
            </tr>
            <tr>
                <td>借款期限</td>
                <td>{{content.invest_time_limit}}天</td>
            </tr>
            <tr>
                <td>借款到期日</td>
                <td>借款起息日 + {{content.invest_time_limit}}天</td>
            </tr>
            <tr>
                <td>借款利率（年化）</td>
                <td>{{numFormat(content.apr,2)}}%</td>
            </tr>
            <tr>
                <td>丙方补贴利率(年化)</td>
                <td>{{numFormat(content.apr_award,2)}}%</td>
            </tr>
            <tr>
                <td>还款方式</td>
                <td>到期还本付息</td>
            </tr>
            <tr>
                <td>兑付日</td>
                <td>T+1</td>
            </tr>
            <tr>
                <td>借款用途</td>
                <td>流动性资金需求</td>
            </tr>
        </table>
        <p>注： 1、起息日为T日，遇节假日计息规则不变（利息=借款本金*借款期限*借款利率/360）。</p>
        <p>        2、到期日亦是指乙方还本付息日，需在到期当日2：00pm 之前向华侨宝账户充值，如遇节假日则需提前至节假日前最后一个工作日2：00pm 之前完成还款充值。</p>
        <p>        3、兑付期是指借款到期时本息到达甲方（出借方）账户的最长时间。</p>
        <p>2.2 保证</p>
        <p>2.2.1 甲方保证</p>
        <p>a、甲方拥有完全的民事权利能力和行为能力以签署本协议、享有本协议项下的任何权利及履行本协议项下任何义务所必需的一切权利和授权。</p>
        <p>b、甲方签署和履行本协议没有违反适用的法律，亦不会与以其为对象或以其为一方对其资产有约束力的任何协议、协议或其他文件产生任何冲突。</p>
        <p>c、甲方保证其所用于出借的资金开源合法，并且乙方是该资金的合法所有人。如果第三方对资金归属、合法性等问题发生争议，由乙方承担责任。</p>
        <p>2.2.2 乙方保证</p>
        <p>a、乙方拥有完全的民事权利能力和民事行为能力以签署本协议、享有本协议项下任何权利及履行本协议项下任何义务所必需的一切权利和授权。</p>
        <p>b、乙方保证其使用资金用途遵守中国法律规定。</p>
        <p>c、签署和履行本协议没有违反适用的法律，亦不会与以其为对象或以其为一方对其资产有约束力的任何协议、协议或其他文件产生任何冲突。</p>
        <p>2.2.3丙方的中介地位</p>
        <p>a、双方在此同意，作为本次担保适宜的居间服务方及平台提供方，在协议履行过程中出现争议的，丙方有权对本协议相关条款进行合理解释。</p>
        <p>b、双方一致确认，丙方仅为本协议项下的担保事宜提供中介服务，并不就本次借款交易向任何一方承担任何保证责任或其他担保责任。</p>
        <p>2.2.4 丁方保证</p>
        <p>a、丁方是按照中国法律合法设立并有效存续的公司，拥有担保能力。</p>
        <p>b、丁方保证其在签署和履行本协议时具备法定的权利和能力，已采取或将采取必要的公司行为进行适当授权等。</p>
        <p>2.2.5甲方和乙方理解并知晓丁方作为连带保证人对乙方在借款协议项下的全部本息兑付承担连带保证责任。</p>
        <p>2.2.6如果乙方在逾期次日未支付当期应还本金及利息，甲乙双方授权丙方向保证人丁方告知逾期情况，由丙方向丁方发出代偿指令并提供借款人截至逾期发生之日的还款记录证明与逾期款项金额，保证人丁方将根据保证申请函以及保证函的约定向甲方承担保证责任。甲、乙双方在此确认，在保证人向甲方赔付本协议项下的本金和利息时，乙方将对于甲方的全部权益（包括追究乙方违约责任的权利）转让给丁方。</p>
        <h3>第三条 各方权利和义务</h3>
        <p>3.1甲方的权利和义务</p>
        <p>a、甲方自愿根据乙方的要约将一定的金额出借给乙方，并享有其所出借款项所带来的利息收益；</p>
        <p>b、主动了解借款人（乙方）的信用风险，确认具有相应的风险认知和承受能力；</p>
        <p>c、如乙方违约，甲方有权要求丙方提供其已获得的乙方信息；</p>
        <p>d、甲方应主动缴纳由利息所得带来的可能的税费，并自行承担借贷产生的本息损失；</p>
        <p>e、甲方理解并同意，向乙方出借相应款项时，委托丙方在本协议生效时授权恒丰银行将该笔借款通过甲方在恒丰银行存管账户划付至乙方在恒丰银行的存管账户；</p>
        <p>f、借贷合同及有关协议约定的其它义务。</p>
        <p>3.2乙方的权利和义务</p>
        <p>a、乙方须提供真实、准确、完整的用户信息及融资信息；</p>
        <p>b、乙方必须按期足额向甲方偿还本息和向丙方支付平台服务费；</p>
        <p>c、乙方同意委托/授权丁方通过乙方的“华侨宝”平台账户按期足额向甲方偿还本金；</p>
        <p>d、乙方应当向甲方和丙方提供在所有网络借贷信息中介机构未偿还借款信息；</p>
        <p>e、乙方应向甲方和丙方如实报告影响或可能影响甲方权益的重大信息；</p>
        <p>f、乙方须确保自身具有与借款金额相匹配的还款能力并按照合同约定还款，不得提前还款；</p>
        <p>g、乙方承诺按照约定用途使用借贷资金，不得用于股票投资、场外配资、期货合约、结构化产品及其它衍生品等高风险或者违法的用途；</p>
        <p>h、乙方不得通过故意变换身份、虚假融资项目、夸大融资项目收益前景等形式的欺诈借款；</p>
        <p>i、不得同时通过多个网络借贷信息中介机构，或者通过变换项目名称、对项目内容进行非实质性变更等方式，就同一融资项目进行重复融资；</p>
        <p>j、不得在丙方平台以外的公开场所发布同一融资项目的信息；</p>
        <p>k、除丁方外，乙方不得将本协议项下的任何权利义务转让给任何其他方；</p>
        <p>l、法律法规和网络借贷有关监管规定禁止从事的其它活动。</p>
        <p>3.3丙方的权利和义务</p>
        <p>a、丙方应对甲乙双方的资格条件、信息的真实性、借款用途的真实性、合法性进行必要的审核；</p>
        <p>b、丙方应采取措施防范欺诈行为，发现欺诈行为或其它损害甲方利益的情形，及时公告并终止相关网络借贷活动；</p>
        <p>c、甲乙双方同意授权丙方委托恒丰银行对甲乙双方的借贷资金进行存管，并按甲乙双方要求进行清算。</p>
        <p>d、甲方同意向乙方出借相应款项时，已委托丙方在本协议生效时授权恒丰银行将该笔借款通过恒丰银行甲方存管账户划付至乙方存管账户；同样，在乙方还本付息时，乙方已委托丙方授权恒丰银行将其借款本息通过恒丰银行乙方存管账户再划回至甲方存管账户。</p>
        <p>e、甲乙双方同意丙方有权代甲方在有必要时对乙方进行借款的到期提醒及催收工作，包括但不限于电话通知、发律师函、对乙方提起诉讼等。甲方在此确认明确委托丙方为其进行以上工作，并授权丙方可以将此工作委托给其他第三方进行。乙方对前述委托的提醒、催收事项已明确知晓并应积极配合。</p>
        <p>f、若乙方未按时归还借款本息，逾期次日丙方有权向存管银行发起担保方先行进行还本付息。</p>
        <p>g、丙方接受甲乙双方的委托行为所产生的法律后果由相应委托方承担。如因甲方或乙方或其他方（包括但不限于技术问题）造成的延误或错误，丙方不承担任何责任。</p>
        <p>h、丙方应妥善保管甲乙双方的资料和交易信息，不得删除、篡改，不得非法买卖、泄露甲乙双方的基本信息和交易信息，但因相关权力部门要求（包括但不限于法院、仲裁机构、金融监管机构等），丙方有权披露。</p>
        <p>3.4丁方的权利和义务</p>
        <p>a、丁方须提供真实、准确、完整的用户信息，并保证具有保理服务和金融咨询资质。</p>
        <p>b、丁方应当照借款企业单次借款金额的1%预缴风险缓释金。</p>
        <p>c、乙方未按时履行本协议还款义务的，同时丁方的风险缓释金亦不足偿还该笔借款本息的，丁方应在乙方逾期后的第二个工作日内补足该笔借款的未还本息。</p>
        <h3>第四条 平台服务费</h3>
        <p>a、在本协议中，平台服务费是指因丙方为乙方提供借款/融资信息、信用咨询、评估、还款提醒、账户管理、还款特殊情况沟通等系列相关信息服务而由乙方支付给丙方的报酬。</p>
        <p>b、对于丙方向乙方提供的一系列信息服务，乙方同意在借款/融资成功时向丙方支付本次借款本金的X.XX%（年化）作为平台服务费。</p>
        <p>c、如乙方和丙方协商一致调整平台服务费时，无需经过甲方同意。</p>
        <h3>第五条 违约责任</h3>
        <p>a、合同各方均应严格履行本协议约定的义务，非经各方协商一致或依照本协议约定，任何一方不得解除本协议。</p>
        <p>b、一方违约的，应当承担因违约使得其他各守约方产生的费用和损失，包括但不限于调查费、诉讼费、保全费、律师费、公证费、公告费、交通费、强制执行费等。乙方违约的，其在资金存管账户里有任何余款，丙方有权按照本协议第四条第3项的清偿顺序将乙方的余款用于清偿。</p>
        <p>c、乙方的每次还款均应按照如下顺序清偿：</p>
        <p>（1）罚息；</p>
        <p>（2）欠付利息；</p>
        <p>（3）欠付本金；</p>
        <p>（4）因违约产生的其它费用。</p>
        <p>d、乙方应严格履行还款义务。到期日截至16：30之前，乙方未足额支付应付款项或应付款项未到达乙方资金存管帐户的，则视为逾期。若因乙方逾期还款，除甲方外任何第三方(包括丙方)已先行代偿甲方应收的本金和利息，则视为甲方将其债权转让给第三方(包括丙方)，乙方则应向第三方(包括丙方)支付第三方(包括丙方)先行垫付的款项，并按照下述条款向第三方(包括丙方)支付逾期罚息，自逾期开始之后，逾期本金的正常利息停止计算(丁方逾期未履行担保责任，适用以下罚息)。</p>
        <p>罚息总额 = 逾期本息总额×{{numFormat(content.apr_late,2)}}‰×逾期天数；</p>
        <p>e、第三方（包括丙方）代偿后向乙方追偿的，乙方应当承担由此给第三方(包括丙方)造成的损失，包括但不限于代偿本息、调查费、诉讼费、保全费、律师费、公证费、公告费、交通费、住宿费。</p>
        <p>f、如果乙方逾期支付任何一期还款超过15天，或乙方在逾期后出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为，本协议项下及乙方在丙方平台上所有借款协议项下的全部借款本息提前到期，乙方应立即清偿本协议下尚未偿付的全部本金、利息、罚息等及根据本协议产生的其它全部费用。</p>
        <p>g、如果乙方逾期支付任何一期还款超过15天，或乙方在逾期后出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为，丙方有权将乙方的“逾期记录”记入征信系统，丙方不承担任何法律责任。</p>
        <p>h、如果乙方逾期支付任何一期还款超过15天，或乙方在逾期后出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为，丙方有权将乙方违约失信的相关信息及乙方其它信息向媒体、用人单位、公安机关、检查机关、法律机关披露，丙方不承担任何责任。</p>
        <p>i、在乙方还清全部本金、利息、罚息之前，罚息计算不停止。</p>
        <h3>第六条 提前到期</h3>
        <p>若乙方出现下列情况之一，甲方授权丙方视情况宣布本协议项下的全部借款提前到期，乙方在收到丙方发出的借款提前到期通知后，应立即按实际到期的情形清偿全部本金、利息、罚息及根据本协议产生的其它全部费用：</p>
        <p>a、乙方财务状况发生重大变化或涉及诉讼、仲裁等其它司法程序及其它丙方认为会影响出借款项偿还的情形； </p>
        <p>b、乙方擅自改变出借款/融资用途的； </p>
        <p>c、乙方以本协议项下出借款项从事违法活动；</p>
        <p>d、乙方提供虚假资料或隐瞒重要事实，已经或可能造成出借款项损失的;</p>
        <p>e、乙方拒绝或阻挠丙方对出借款项使用情况进行监督检查的；</p>
        <p>f、乙方违反本协议任何一项约定或对其它债务有违约行为，并被认为足以危及出借款项安全的。</p>
        <h3>第七条 通知及法律文书的送达</h3>
        <p>各方确认，各方本次借款交易相关的所有合同、协议、确认书、通知均可通过电子数据形式呈现，双方对相关互联网页面或电子数据的同意、确认操作即视为合法有效的签署，本次交易所涉及各方主体向对方送达的通知以电子邮件或短信等电子形式提供即视为合法有效的送达。</p>
        <p>各方同意，对于因本协议争议引起的任何纠纷，司法机关（包括但不限于人民法院）可以通过手机短信或电子邮件等现代通讯方式或邮寄方式向各方送达法律文书（包括诉讼文书）；以邮寄方式送达的，各方法定地址（自然人为户籍地址，法人为公司注册地址）为各方指定的邮寄地址。</p>
        <h3>第八条 法律及争议解决</h3>
        <p>本协议的签订、履行、终止、解释均适用中华人民共和国法律，并由丁方所在地区人民法院管辖。第三方（包括丙方）代偿后通过诉讼方式向乙方追偿的，由丁方所在地人民法院管辖。</p>
        <h3>第九条 附则</h3>
        <p>1、本协议采用电子合同形式制成，由丙方委托杭州天谷信息科技有限公司（特指第三方电子合同托管平台公司）提供电子合同在线签署及托管服务并保存在丙方为此设立的专用服务器上备查，保存期不少于5年，各方均认可该形式的协议效力。</p>
        <p>2、本协议经甲乙丙丁四方通过丙方平台以网络在线点击确认的方式订立（或授权订立）并生效。本协议各方委托丙方保管所有与本协议有关的书面文件或电子信息；本协议各方确认并同意由丙方提供的与本协议有关的书面文件或电子信息在无明显错误的情况下应作为本协议有关事项的终局证明。</p>
        <p>3、本协议签订之日起至借款全部清偿之日止，乙方和丁方有义务在下列信息变更三个工作日内提供更新后的信息给丙方：法人、公司的授权委托人、公司的联系信息、银行账户的变更。若因未及时提供上述变更信息而带来的损失或额外费用应由该方承担。</p>
        <p class="st-mb">4、如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但该无效条款并不影响本协议其它条款的效力。</p>
        <div class="u-seal">
            <p>甲方(出借方)（签字/盖章）： </p>
            <p>乙方(借款方)（签字/盖章）： </p>
        </div>
        <div class="u-seal">
            <p>丙方(居间服务方)（签字/盖章）：<img src="'content.stamp_img'" alt=""></p>
            <p>丁方(担保方)（签字/盖章）：  </p>
        </div>
        <p>日期：{{timeFormat(content.sign_date)}}</p>
        <div class="m-tips">
            <h3>重要提示</h3>
            <p>本协议已经平台备案,但平台方接受本协议的备案并不表明其对本协议项下的任何条款做出实质性判断或保证,也不表明平台对本协议承担任何责任及义务。</p>
        </div>
    </div>
</template>

<script>
import { numFormat, timeFormat } from '@/assets/js/cmn/util'
export default {
    data: function(){
        return{
            content:{
                apr:"10.00",
                apr_award:"10.00",
                apr_late:"10.000",
                borrower_credit_code:"1654XXXXXXXXXXXXXX",
                borrower_name:"湖北省XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX",
                id:7023,
                invest_account:"",
                invest_date_limit:"",
                invest_time_limit:"360",
                investor_card_id:"",
                investor_name:"",
                plat_contact:"400-692-2828",
                plat_name:"杭州华侨宝网络科技有限公司",
                plat_website:"https://www.huaqiaobao.cn",
                plat_workspace:"浙江省杭州市江干区西子国际中心1号楼1201室",
                protocol_id:"",
                protocol_template_name:"lemuji",
                sign_date:"",
                stamp_img:"https://www.huaqiaobao.cn/themes/soonmes_default/images/plat_stamp.png",
                warrantor_name:"浙江勤XXXXXXX",
                warrantor_status:"1"
            }
        }
    },
    //props:['content'],
    components:{
        
    },
    methods:{
        numFormat(val, dig){//金额截取
            return numFormat(val, dig)
        },
        timeFormat(val, type){//时间戳转化
            return timeFormat(val, type)
        }
    },
    mounted () {}
}
</script>